{
    "Argument in Multi-Agent Systems":" Multi-agent systems research is concerned both with the modelling of human and animal societies and with the development of principles for the design of practical distributed information management systems. This position paper will, rather than examine the various dierences in perspective within this area of research, discuss issues of communication and commitment that are of interest to multi-agent systems research in general. 1 Introduction A computational society is a collection of autonomous agents that are loosely dependent upon each other. The intentional stance [12] is often taken in describing the state of these agents. An agent may have beliefs, desires, intentions, and it may adopt a role or have relationships with others. Thus, multi-agent systems (MAS) as with most AI research is signi cantly inuenced, at least in its vocabulary, by philosophy and cognitive psychology. 1 So, what's the point? Computational societies are developed for two primary reasons:  Mode...",
    "Modeling Sociality In The Bdi Framework":"Multi-agent systems research is concerned both with the modelling of human and animal societies and with the development of principles for the design of practical distributed information management systems. This position paper will, rather than examine the various dierences in perspective within this area of research, discuss issues of communication and commitment that are of interest to multi-agent systems research in general. 1 Introduction A computational society is a collection of autonomous agents that are loosely dependent upon each other. The intentional stance [12] is often taken in describing the state of these agents. An agent may have beliefs, desires, intentions, and it may adopt a role or have relationships with others. Thus, multi-agent systems (MAS) as with most AI research is signi cantly inuenced, at least in its vocabulary, by philosophy and cognitive psychology. 1 So, what's the point? Computational societies are developed for two primary reasons:  Mode...",
    "Goal Creation in Motivated Agents":"Goal creation is an important consideration for an agent that is required to behave autonomously in a real-world domain. This paper describes an agent that is directed, not by a conjunction of top level goals, but by a set of motives. The agent is motivated to create and prioritise different goals at different times as a part of an on-going activity under changing circumstances. Goals can be created both in reaction to, and in anticipation of a situation. While there has been much work on the creation of reactive goals, i.e. goals created in reaction to a situation, the issues involved in the creation of anticipatory, or proactive goals have not been considered in depth. The solution to the goal creation problem outlined here provides an agent with an effective method of creating goals both reactively and proactively, giving the agent a greater degree of autonomy. 1 Introduction  The focus of planning research has principally been concerned with the creation of good plans to satisfy ...",
    "Decomposition in data mining: An industrial case study":"Goal creation is an important consideration for an agent that is required to behave autonomously in a real-world domain. This paper describes an agent that is directed, not by a conjunction of top level goals, but by a set of motives. The agent is motivated to create and prioritise different goals at different times as a part of an on-going activity under changing circumstances. Goals can be created both in reaction to, and in anticipation of a situation. While there has been much work on the creation of reactive goals, i.e. goals created in reaction to a situation, the issues involved in the creation of anticipatory, or proactive goals have not been considered in depth. The solution to the goal creation problem outlined here provides an agent with an effective method of creating goals both reactively and proactively, giving the agent a greater degree of autonomy. 1 Introduction  The focus of planning research has principally been concerned with the creation of good plans to satisfy ...",
    "Rough Set Theory: A Data Mining Tool for Semiconductor Manufacturing":"The growing volume of information poses interesting challenges and calls for tools that discover properties of data. Data mining has emerged as a discipline that contributes tools for data analysis, discovery of new knowledge, and autonomous decisionmaking. In this paper, the basic concepts of rough set theory and other aspects of data mining are introduced. The rough set theory offers a viable approach for extraction of decision rules from data sets. The extracted rules can be used for making predictions in the semiconductor industry and other applications. This contrasts other approaches such as regression analysis and neural networks where a single model is built. One of the goals of data mining is to extract meaningful knowledge. The power, generality, accuracy, and longevity of decision rules can be increased by the application of concepts from systems engineering and evolutionary computation introduced in this paper. A new rule-structuring algorithm is proposed. The concepts presented in the paper are illustrated with examples.",
    "Exploration versus Exploitation in Topic Driven Crawlers":"Topic driven crawlers are increasingly seen as a way to address the scalability limitations of universal search engines, by distributing the crawling process across users, queries, or even client computers. The context available to a topic driven crawler allows for informed decisions about how to prioritize the links to be explored, given time and bandwidth constraints. We have developed a framework and a number of methods to evaluate the performance of topic driven crawler algorithms in a fair way, under limited memory resources. Quality metrics are derived from lexical features, link analysis, and a hybrid combination of the two. In this paper we focus on the issue of how greedy a crawler should be. Given noisy quality estimates of links in a frontier, we investigate what is an appropriate balance between a crawler's need to exploit this information to focus on the most promising links, and the need to explore links that appear suboptimal but might lead to more relevant pages. We show that exploration is essential to locate the most relevant pages under a number of quality measures, in spite of a penalty in the early stage of the crawl.",
    "Web Crawling Agents for Retrieving Biomedical Information":"Autonomous agents for topic driven retrieval of information from the Web are currently a very active area of research. The ability to conduct real time searches for information is important for many users including biomedical scientists, health care professionals and the general public. We present preliminary research on different retrieval agents tested on their ability to retrieve biomedical information, whose relevance is assessed using both genetic and ontological expertise. In particular, the agents are judged on their performance in fetching information about diseases when given information about genes. We discuss several key insights into the particular challenges of agent based retrieval learned from our initial experience in the biomedical domain.",
    "Target Seeking Crawlers and their Topical Performance":"Topic driven crawlers can complement search engines by targeting relevant portions of the Web. A topic driven crawler must exploit the information available about the topic and its underlying context. In this paper we extend our previous research on the design and evaluation of topic driven crawlers by comparing seven different crawlers on a harder problem, namely, seeking highly relevant target pages. We find that exploration is an important aspect of a crawling strategy. We also study how the performance of crawler strategies depends on a number of topical characteristics based on notions of topic generality, cohesiveness, and authoritativeness. Our results reveal that topic generality is an obstacle for most crawlers, that three crawlers tend to perform better when the target pages are clustered together, and that two of these also display better performance when topic targets are highly authoritative.",
    "Topic-Driven Crawlers: Machine Learning Issues":"Topic driven crawlers are increasingly seen as a way to address the scalability limitations of universal  search engines, by distributing the crawling process across users, queries, or even client computers.",
    "Software Engineering and Middleware: A Roadmap":"The construction of a large class of distributed systems can be simplified by leveraging middleware, which is layered between network operating systems and application components. Middleware resolves heterogeneity, and facilitates communication and coordination of distributed components. State of-the-practice middleware products enable software engineers to build systems that are distributed across a localarea network. State-of-the-art middleware research aims to push this boundary towards Internet-scale distribution, adaptive systems, middleware for dependable and wireless systems. The challenge for software engineering research is to devise notations, techniques, methods and tools for distributed system construction that systematically build and exploit the capabilities that middleware products deliver, now and in the future.",
    "Incremental Code Mobility with XML":"We demonstrate how XML and related technologies can be used for code mobility at any granularity, thus overcoming the restrictions of existing approaches. By not fixing a particular granularity for mobile code, we enable complete programs as well as individual lines of code to be sent across the network. We define the concept of incremental code mobility as the ability to migrate and add, remove, or replace code fragments (i.e., increments) in a remote program. The combination of fine-grained and incremental mobility achieves a previously unavailable degree of flexibility. We examine the application of incremental and fine-grained code mobility to a variety of domains, including user interface management, application management on mobile thin clients, for example PDAs, and management of distributed documents.  Keywords  Incremental Code Mobility, XML Technologies  1 INTRODUCTION  The increasing popularity of Java and the spread of Webbased technologies are contributing to a growing int...",
    "Implementing incremental code migration with XML":"We demonstrate how XML and related technologies can be used for code mobility at any granularity, thus overcoming the restrictions of existing approaches. By not fixing a particular granularity for mobile code, we enable complete programs as well as individual lines of code to be sent across the network. We define the concept of incremental code mobility as the ability to migrate and add, remove, or replace code fragments (i.e., increments) in a remote program. The combination of fine-grained and incremental mobility achieves a previously unavailable degree of flexibility. We examine the application of incremental and fine-grained code mobility to a variety of domains, including user interface management, application management on mobile thin clients, for example PDAs, and management of distributed documents.  Keywords  Incremental Code Mobility, XML Technologies  1 INTRODUCTION  The increasing popularity of Java and the spread of Webbased technologies are contributing to a growing int..."
}